FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
        case 3:  // Second blink OFF
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);
            if (current_tick - previous_tick >= 100) {  // 100ms OFF
                previous_tick = current_tick;
                state = 4;
            }
            break;

        case 4:                                         // Long pause
            if (current_tick - previous_tick >= 500) {  // 500ms pause
                previous_tick = current_tick;
                state = 0;  // Restart cycle
            }
            break;
    }
}

/**
 * @brief LED startup animation
 * @note  This function performs a startup animation for the LEDs.
 */
void startup_leds_animation(void) {
    // LED startup animation
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_Heartbeat_Pin, GPIO_PIN_SET);
    HAL_Delay(350);
    HAL_GPIO_WritePin(GPIOB, LED_Heartbeat_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);

    // Turn off all LEDs
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_RESET);
}

/**
 * @brief Fade LED in and out using software PWM
 * @param GPIO_Port GPIO port of the LED
 * @param GPIO_Pin GPIO pin of the LED
 */
void led_fade_nonblocking(GPIO_TypeDef *GPIO_Port, uint16_t GPIO_Pin) {
    static uint32_t last_update_time = 0;
    static uint32_t fade_counter = 0;
    static uint32_t pwm_counter = 0;
    static const uint32_t PWM_PERIOD = 5;    // PWM period for software PWM
    static const uint32_t FADE_PERIOD = 50;  // How fast the LED brightness changes

    uint32_t current_time = HAL_GetTick();

    // Update fade counter (determines brightness level)
    if (current_time - last_update_time >= FADE_PERIOD) {
        fade_counter = (fade_counter + 1) % 200;  // 0-199 range for smooth transition
        last_update_time = current_time;
        pwm_counter = 0;  // Reset PWM counter on brightness change
    }

    // Calculate current brightness level (0-100)
    uint32_t brightness;
    if (fade_counter < 100) {
        brightness = fade_counter;  // Fade in (0-99)
    } else {
        brightness = 200 - fade_counter;  // Fade out (99-0)
    }

    // Implement software PWM
    pwm_counter = (pwm_counter + 2) % PWM_PERIOD;

    if (pwm_counter < brightness) {
        HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_SET);  // Turn LED on
    } else {
        HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);  // Turn LED off
    }
}

/**
 * @brief Update PWM value for LED fading effect using hardware timer
 * @param htim PWM timer handle
 * @param channel Timer channel to update
 */
void led_fade_pwm(TIM_HandleTypeDef *htim, uint32_t channel) {
    static uint32_t last_update_time = 0;
    static uint16_t brightness = 0;
    static int8_t direction = 1;                 // 1 = increasing, -1 = decreasing
    static const uint32_t FADE_PERIOD = 10;      // Update interval in ms
    static const uint16_t MAX_BRIGHTNESS = 100;  // Maximum PWM value

    uint32_t current_time = HAL_GetTick();

    // Update PWM value at regular intervals
    if (current_time - last_update_time >= FADE_PERIOD) {
        last_update_time = current_time;

        // Update brightness based on current direction
        brightness += direction;

        // Change direction at limits
        if (brightness >= MAX_BRIGHTNESS) {
            direction = -1;  // Start decreasing
        } else if (brightness <= 0) {
            direction = 1;  // Start increasing
        }

        // Apply new PWM value (constraining to valid range)
        if (brightness > MAX_BRIGHTNESS) brightness = MAX_BRIGHTNESS;
        if (brightness < 0) brightness = 0;

        __HAL_TIM_SET_COMPARE(htim, channel, brightness);
    }
}

/* -------------------- R2D SOUND FUNCTIONS -------------------- */
/**
 * @brief Start playing the Ready-To-Drive sound
 * @details This function activates the buzzer to play the R2D sound
 *          as required by EV4.12 regulations (80-90 dBA, 1-3 seconds).
 */
void StartR2DSound(void) {
    // Activate only if not already playing
    if (!vcu.r2d_sound_playing && !vcu.r2d_sound_completed) {
        vcu.r2d_sound_playing = true;
        vcu.r2d_sound_start_time = HAL_GetTick();

        // Activate buzzer - set the GPIO pin that controls the buzzer
        HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_SET);

        printf("\n\rR2D Sound: Started\n\r");
    }
}

/**
 * @brief Update the Ready-To-Drive sound state
 * @details Checks if R2D sound needs to be stopped based on timing
 *          requirements (1-3 seconds continuous sound).
 */
void UpdateR2DSound(void) {
    // If sound is playing, check if it's time to stop
    if (vcu.r2d_sound_playing) {
        uint32_t current_time = HAL_GetTick();
        uint32_t elapsed_time = current_time - vcu.r2d_sound_start_time;

        // Sound duration: 2 seconds (2000 ms)
        if (elapsed_time >= 1000) {
            // Stop the sound
            HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
            vcu.r2d_sound_playing = false;
            vcu.r2d_sound_completed = true;

            printf("\n\rR2D Sound: Completed\n\r");
        }
    }
}

/**
 * @brief Reset the Ready-To-Drive sound state
 * @details Resets the R2D sound flags when leaving a ready state.
 */
void ResetR2DSound(void) {
    vcu.r2d_sound_playing = false;
    vcu.r2d_sound_completed = false;
    HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
}

/**
 * @brief Start playing the Emergency sound
 * @details This function activates the buzzer to play an intermittent emergency sound
 *          with frequency 1-5Hz, 50% duty cycle, for 8-10 seconds.
 */
void StartEmergencySound(void) {
    // Only start if not already playing
    if (!vcu.emergency_sound_playing && !vcu.emergency_sound_completed) {
        vcu.emergency_sound_playing = true;
        vcu.emergency_sound_start_time = HAL_GetTick();
        vcu.emergency_sound_last_toggle = HAL_GetTick();
        vcu.emergency_sound_state = true;  // Start with buzzer ON

        // Activate buzzer
        HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_SET);

        printf("\n\rEmergency Sound: Started\n\r");
    }
}

/**
 * @brief Update the Emergency sound state
 * @details Manages the intermittent pattern (1-5Hz, 50% duty cycle) and duration (8-10s)
 *          of the emergency sound.
 */
void UpdateEmergencySound(void) {
    if (vcu.emergency_sound_playing) {
        uint32_t current_time = HAL_GetTick();
        uint32_t total_elapsed_time = current_time - vcu.emergency_sound_start_time;
        uint32_t toggle_elapsed_time = current_time - vcu.emergency_sound_last_toggle;

        // Using 2.5Hz frequency (200ms ON, 200ms OFF)
        const uint32_t TOGGLE_INTERVAL_MS = 200;

        // Toggle buzzer state at specified frequency (2.5Hz)
        if (toggle_elapsed_time >= TOGGLE_INTERVAL_MS) {
            vcu.emergency_sound_state = !vcu.emergency_sound_state;
            HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin,
                              vcu.emergency_sound_state ? GPIO_PIN_SET : GPIO_PIN_RESET);
            vcu.emergency_sound_last_toggle = current_time;
        }

        // Total sound duration: 9 seconds
        const uint32_t EMERGENCY_SOUND_DURATION_MS = 9000;

        // Stop sound after duration completes
        if (total_elapsed_time >= EMERGENCY_SOUND_DURATION_MS) {
            // Stop the sound
            HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
            vcu.emergency_sound_playing = false;
            vcu.emergency_sound_completed = true;

            printf("\n\rEmergency Sound: Completed\n\r");
        }
    }
}

/**
 * @brief Reset the Emergency sound state
 * @details Resets the emergency sound flags when leaving the emergency state.
 */
void ResetEmergencySound(void) {
    vcu.emergency_sound_playing = false;
    vcu.emergency_sound_completed = false;
    vcu.emergency_sound_state = false;
    HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
}

/**
 * @brief Handle emergency stop condition
 * @details Sounds the buzzer with required pattern if an emergency stop is detected
 */
void HandleEmergencyStop(void) {
    if ((as_system.state == 4) || res.signal == 0) {
        // Start emergency sound if not already playing or completed
        if (!vcu.emergency_sound_playing && !vcu.emergency_sound_completed) {
            StartEmergencySound();
            // Disable R2D state
            vcu.r2d_toggle_signal = false;
            vcu.r2d_autonomous_signal = false;
        }

        // Update emergency sound pattern
        UpdateEmergencySound();
    } else {
        // Reset emergency sound state when emergency condition clears
        ResetEmergencySound();
    }
}

