FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
/* -------------------- STATE MACHINE FUNCTIONS -------------------- */
/**
 * @brief Print state transition for debugging
 * @param from Previous state
 * @param to New state
 */
void print_state_transition(VCU_STATE_t from, VCU_STATE_t to) {
    printf("\n\rState transition: %s -> %s\n", state_names[from], state_names[to]);
}

/**
 * @brief Update the state of the VCU based on inputs and conditions
 */
void UpdateState(void) {
    // Store current state for change detection
    previous_state = current_state;

    // Process emergency condition with highest priority
    if (((as_system.state == 4) || (res.signal == 0)) && current_state != STATE_AS_EMERGENCY) {
        current_state = STATE_AS_EMERGENCY;
        // return;  // Exit early - emergency takes precedence
    }

    // Read raw button state
    bool current_r2d_button = HAL_GPIO_ReadPin(int2_r2d_GPIO_Port, int2_r2d_Pin);

    // Detect rising edge (button press) for toggle behavior
    if (current_r2d_button && !vcu.r2d_button_prev) {
        vcu.r2d_toggle_signal = !vcu.r2d_toggle_signal;  // Toggle on button press
    }

    // Store current button state for next iteration
    vcu.r2d_button_prev = current_r2d_button;

    // Also store the raw button signal for any code that still needs it
    vcu.r2d_button_signal = current_r2d_button;

    vcu.ignition_switch_signal = HAL_GPIO_ReadPin(int1_ign_GPIO_Port, int1_ign_Pin);
    vcu.ignition_ad = acu.ignition_ad;  // Read ignition signal from autonomous system

    // State transitions
    switch (current_state) {
        case STATE_INIT:
            current_state = STATE_STANDBY;  // Transition to standby state after initialization
            break;
        case STATE_STANDBY:
            // if precharge is request either for manual or autonomous mode start the precharge
            if (vcu.ignition_switch_signal) {
                current_state = STATE_PRECHARGE;  // Transition to precharge state
                vcu.manual = true;                // Set manual mode
                vcu.autonomous = false;           // Clear autonomous mode
            } else if (vcu.ignition_ad && acu.ASMS) {
                current_state = STATE_PRECHARGE;  // Transition to precharge state
                vcu.manual = false;               // Clear manual mode
                vcu.autonomous = true;            // Set autonomous mode
            }
            break;

        case STATE_PRECHARGE:
            // when the precharge is done, wait for the ready to drive signal to start the ready to drive
            // either from manual or autonomous mode-

            // Check if precharge is complete
            // TODO fazer a diferenca entre a tensao do inversor e do bms e ver se esta a 90% reais

            if (!vcu.ignition_switch_signal && !vcu.ignition_ad) {
                current_state = STATE_STANDBY;
            } else if (Bypass_precharge || (bms.precharge_circuit_state == 9) || myHV500.Actual_InputVoltage > 450) {
                current_state = vcu.manual ? STATE_WAITING_FOR_R2D_MANUAL : STATE_WAITING_FOR_R2D_AUTO;
            }

            break;

        case STATE_WAITING_FOR_R2D_MANUAL:

            if (!vcu.ignition_switch_signal) {
                current_state = STATE_STANDBY;
            } else if (vcu.r2d_toggle_signal && (Bypass_brake_pressure || vcu.brake_pressure > BRAKE_PRESSURE_THRESHOLD)) {
                current_state = STATE_READY_MANUAL;
            }
            break;

        case STATE_WAITING_FOR_R2D_AUTO:
            if (!vcu.ignition_ad) {
                current_state = STATE_STANDBY;
            } else if (as_system.state == 3) {  // driving state
                current_state = STATE_READY_AUTONOMOUS;
            }
            break;

        case STATE_READY_MANUAL:

            if (!vcu.ignition_switch_signal) {
                // Change to standby if ignition is off
                current_state = STATE_STANDBY;
            } else if (!vcu.r2d_toggle_signal) {
                // Change to waiting for R2D manual if the button is pressed again
                current_state = STATE_WAITING_FOR_R2D_MANUAL;
            }
            break;

        case STATE_READY_AUTONOMOUS:
            // serve as gateway to the computer to send the commands to the inverter

            if (!vcu.ignition_ad) {
                current_state = STATE_STANDBY;
            } else if (as_system.state != 3) {
                current_state = STATE_WAITING_FOR_R2D_AUTO;
            }
            break;

        case STATE_AS_EMERGENCY:
            // TODO fazer isto verificar com os autonomos e o bruno
            // printf("\n\rAS Emergency: %d\n\r", as_system.state);

            if (vcu.ignition_ad == false) {
                current_state = STATE_STANDBY;
            } else if (as_system.state != 4 && res.signal != 0) {
                current_state = STATE_STANDBY;
            }

            break;
    }

    // Execute entry actions when state has changed
    if (current_state != previous_state) {
#ifdef print_state
        print_state_transition(previous_state, current_state);
#endif
        // State entry actions
        switch (current_state) {
            case STATE_INIT:
                break;

            case STATE_STANDBY:
                // Reset critical flags when entering standby
                vcu.manual = false;
                vcu.autonomous = false;

                vcu.r2d_button_signal = false;      // Reset R2D button signal
                vcu.r2d_toggle_signal = false;      // Reset R2D toggle signal
                vcu.r2d_autonomous_signal = false;  // Reset R2D autonomous signal
                ResetR2DSound();                    // Reset R2D sound state
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_RESET);

                //__HAL_TIM_SetCompare(&htim4, TIM_CHANNEL_1, 0);  // Set PWM to 0% duty cycle
                // HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1);         // Stop PWM for R2D LED

                HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
                vcu.r2d_button_signal = false;  // Reset R2D button signal
                break;

            case STATE_PRECHARGE:
                // Precharge state entry actions
                HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);        // Turn on ignition LED debug
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_SET);  // Activate BMS ignition

                //__HAL_TIM_SetCompare(&htim4, TIM_CHANNEL_1, 0);  // Set PWM to 0% duty cycle
                // HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1);         // Stop PWM for R2D LED
                break;

            case STATE_WAITING_FOR_R2D_AUTO:
            case STATE_WAITING_FOR_R2D_MANUAL:
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_SET);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);  // Turn off R2D LED
                // HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);
                ResetR2DSound();  // Reset R2D sound state
                break;

            case STATE_READY_MANUAL:
            case STATE_READY_AUTONOMOUS:
                // Common setup for ready states
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_SET);
                // r2d led 100% on
                //__HAL_TIM_SetCompare(&htim4, TIM_CHANNEL_1, 100);  // Set PWM to 100% duty cycle
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_SET);

                // Play R2D sound when entering a ready state
                StartR2DSound();
                break;

            case STATE_AS_EMERGENCY:
                // Emergency entry actions
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_RESET);
                // HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, !GPIO_PIN_RESET);
                //__HAL_TIM_SetCompare(&htim4, TIM_CHANNEL_1, 0);  // Set PWM to 0% duty cycle
                // HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1);         // Stop PWM for R2D LED
                break;
        }
    }
}

/**
 * @brief Handle actions specific to the current state
 */
void HandleState(void) {
    // Update R2D sound status if it's playing
    UpdateR2DSound();

    switch (current_state) {
        case STATE_INIT:
            // Initialization actions
            break;

        case STATE_STANDBY:

            break;

        case STATE_PRECHARGE:
            // Handle precharge process

            break;

        case STATE_WAITING_FOR_R2D_MANUAL:
            // fade in and out the R2D LED
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            // Use hardware PWM for LED fading
            // led_fade_pwm(&htim4, TIM_CHANNEL_1);
            break;

        case STATE_WAITING_FOR_R2D_AUTO:
            // Waiting indicator for autonomous mode
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            // Use hardware PWM for LED fading
            // led_fade_pwm(&htim4, TIM_CHANNEL_1);

            break;

        case STATE_READY_MANUAL:
            // Process manual driving controls
            // Send pedal position to inverter

