FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
            static uint32_t last_can_send_time_manuel = 0;
            uint32_t current_time_manuel = HAL_GetTick();

            if (current_time_manuel - last_can_send_time_manuel >= 5) {
                can_bus_send_HV500_SetDriveEnable(1, &hcan2);
                can_bus_send_HV500_SetRelCurrent(result.percentage_1000, &hcan2);
                last_can_send_time_manuel = current_time_manuel;
            }

            break;

        case STATE_READY_AUTONOMOUS:
            // Forward autonomous commands to inverter
            static uint32_t last_can_send_time_auto = 0;
            uint32_t current_time_auto = HAL_GetTick();

            if (current_time_auto - last_can_send_time_auto >= 10) {
                can_bus_send_HV500_SetDriveEnable(1, &hcan2);

                if (as_system.target_rpm > MAX_RPM_AD) {
                    as_system.target_rpm = MAX_RPM_AD;
                } else if (as_system.target_rpm < 0) {
                    as_system.target_rpm = 0;
                }

                uint32_t erpm = as_system.target_rpm * 10;
                can_bus_send_HV500_SetERPM(erpm, &hcan2);
                can_send_vcu_rpm(&hcan3, myHV500.Actual_ERPM / 10);
                last_can_send_time_auto = current_time_auto;

                // printf("\n\rRPM: %d\n\r", myHV500.Actual_ERPM / 10);
                // printf("\n\rTarget RPM: %d\n\r", as_system.target_rpm);
            }
            break;

        case STATE_AS_EMERGENCY:
            // Activate emergency indicators
            // Handle emergency state
            HandleEmergencyStop();
            break;
    }
}

/* -------------------- COMMUNICATION FUNCTIONS -------------------- */

/**
 * @brief Redirect printf to UART
 */
PUTCHAR_PROTOTYPE {
    /* Place your implementation of fputc here */
    /* e.g. write a character to the USART1 and Loop until the end of transmission */
    HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, 0xFFFF);

    return ch;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
    current_state = STATE_INIT;
  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

    // HAL_ADC_Start_DMA(&hadc3, (uint32_t *)&adc_buffer, 5);

    // HAL_ADC_Start(&hadc3);

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_ADC3_Init();
  MX_CAN1_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_CAN2_Init();
  MX_CAN3_Init();
  MX_TIM4_Init();
  /* USER CODE BEGIN 2 */

    // Configure filters with different banks
    CAN1_Filter_Config();
    CAN2_Filter_Config();
    CAN3_Filter_Config();

    // Enable interrupts for all
    if (HAL_CAN_ActivateNotification(&hcan1, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_CAN_ActivateNotification(&hcan2, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_CAN_ActivateNotification(&hcan3, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }

    HAL_CAN_Start(&hcan1);
    HAL_CAN_Start(&hcan2);
    HAL_CAN_Start(&hcan3);

    startup_leds_animation();
    MovingAverage_Init();  // Initialize moving average buffers

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

    // HAL_ADC_Start_DMA(&hadc1, ADC1_VAL, 4);
    HAL_ADC_Start_DMA(&hadc2, ADC2_APPS, 2);  // Start ADC2 for APPS
                                              // Calibrate APPS

    APPS_Init(__APPS_MIN_BITS, __APPS_MAX_BITS, __APPS_TOLERANCE, __APPS_DELTA);  // Initialize APPS
    res.signal = 11;                                                              // start with a value different than 0 to avoid emergency state
    printf("\n\n\n\n\n======================== RESET ========================\n\n\n\n\n\r");

#if CALIBRATE_APPS
    APPS_StartCalibration();
#endif

    while (1) {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
        heartbeat_nonblocking(GPIOB, LED_Heartbeat_Pin);

        if (HAL_CAN_GetRxFifoFillLevel(&hcan3, CAN_RX_FIFO0) > 0) {
            CAN_RxHeaderTypeDef RxHeader;
            uint8_t RxData[8];
            if (HAL_CAN_GetRxMessage(&hcan3, CAN_RX_FIFO0, &RxHeader, RxData) == HAL_OK) {
                decode_auto_bus(RxHeader, RxData);
            }
        }

        if (HAL_CAN_GetRxFifoFillLevel(&hcan2, CAN_RX_FIFO0) > 0) {
            CAN_RxHeaderTypeDef RxHeader2;
            uint8_t RxData2[8];
            if (HAL_CAN_GetRxMessage(&hcan2, CAN_RX_FIFO0, &RxHeader2, RxData2) == HAL_OK) {
                can_filter_id_bus2(RxHeader2, RxData2);
            }
        }

        // if (HAL_CAN_GetRxFifoFillLevel(&hcan2, CAN_RX_FIFO0) > 0) {
        //     if (HAL_CAN_GetRxMessage(&hcan2, CAN_RX_FIFO0, &RxHeader, RxData) == HAL_OK) {
        //         // decode_auto_bus(RxHeader, RxData);
        //     }
        // }
        // if (HAL_CAN_GetRxFifoFillLevel(&hcan1, CAN_RX_FIFO0) > 0) {
        //     if (HAL_CAN_GetRxMessage(&hcan1, CAN_RX_FIFO0, &RxHeader, RxData) == HAL_OK) {
        //         // decode_auto_bus(RxHeader, RxData);
        //     }
        // }

        static uint32_t previous_tick = 0;
        uint32_t current_tick = HAL_GetTick();
        if (current_tick - previous_tick >= 200) {
            // can_send_autonomous_HV_signal(&hcan3, bms.precharge_circuit_state);
            uint8_t data[8] = {0};
            CAN_TxHeaderTypeDef TxHeader;
            TxHeader.StdId = 0x410;
            TxHeader.ExtId = 0;
            TxHeader.RTR = CAN_RTR_DATA;
            TxHeader.IDE = CAN_ID_STD;
            TxHeader.DLC = 8;
            TxHeader.TransmitGlobalTime = DISABLE;

            uint32_t TxMailbox;

            HAL_CAN_AddTxMessage(&hcan3, &TxHeader, data, &TxMailbox);

            result = APPS_Process(apps2_avg, apps1_avg);

#if CALIBRATE_APPS
            // If calibration is in progress, update it
            if (APPS_IsCalibrating()) {
                bool calibration_complete = APPS_Calibrate(apps1_avg, apps2_avg);
                if (calibration_complete) {
                    // Optionally, automatically apply the calibration
                    uint16_t min, max, tolerance, delta;
                    APPS_GetCalibrationValues(&min, &max, &tolerance, &delta);
                    APPS_Init(min, max, tolerance, delta);
                }
            }
#endif
#if print_apps
            APPS_PrintStatus();
#endif

            vcu.brake_pressure = MeasureBrakePressure(ADC1_VAL[0]);
            // printf("\n\rBrake Pressure: %d\n\r", vcu.brake_pressure);

